<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bbf0bfa1628f1e57bafd8185116c09475307aa0159317d6df740aa0745d70b6c","plan_job_ref":"Job Create terraform plan #11 at https://github.com/leonitousconforti/infra/actions/runs/15407574838","plan_out_hash":"fff9926fe47e2857d9b63aa84ba836c1a9413f551654ac65823dbbd21bf78614","plan_hash":"ae646afa41dd671222e4f56a87dc85f60b18a855406cfad0aecb71031d1942ef","plan_text_format":"diff","version":"2.0.0"} -->
Terraform plan in __leo69.lol__<details open><summary>With variables</summary>

```hcl
porkbun_api_key    = (sensitive value)
porkbun_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_domain.leo69_lol will be created
+   resource "digitalocean_domain" "leo69_lol" {
+       id   = (known after apply)
+       name = "leo69.lol"
+       ttl  = (known after apply)
+       urn  = (known after apply)
    }

  # digitalocean_record.ns1 will be created
+   resource "digitalocean_record" "ns1" {
+       domain = "leo69.lol"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "leo69.lol"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns1.digitalocean.com"
    }

  # digitalocean_record.ns2 will be created
+   resource "digitalocean_record" "ns2" {
+       domain = "leo69.lol"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "leo69.lol"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns2.digitalocean.com"
    }

  # digitalocean_record.ns3 will be created
+   resource "digitalocean_record" "ns3" {
+       domain = "leo69.lol"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "leo69.lol"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns3.digitalocean.com"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #11](https://github.com/leonitousconforti/infra/actions/runs/15407574838)